---
kind: property
id: P:Autodesk.Revit.DB.FabricationConfigurationInfo.UnitSystem
source: html/dc5ae157-bc0c-c60f-0909-e602638d6030.htm
---
# Autodesk.Revit.DB.FabricationConfigurationInfo.UnitSystem Property

The unit system of the fabrication configuration. Units can be UnitSystem.Metric or UnitSystem.Imperial.

## Syntax (C#)
```csharp
public UnitSystem UnitSystem { get; }
```